In [18]:
import pandas as pd 

df = pd.read_csv(r'E:\Users\Sergio\OneDrive\git\python\fake_datasets\csv\dados_clientes.csv', encoding= 'latin')
df.head()

,id_cliente,nome,sobrenome,sexo,cpf,grau_instrucao,uf,cep,idade
0,-4835863059640323805,ALINE,BETTIN BAIENSE,F,36919884666,fundamental completo,MG,32401-614,25.653283
1,-7812228504367106399,ARAO,RASMUSEN TYRNE FUMANESI,M,30289361869,fundamental incompleto,SP,15253-864,29.496348
2,-615496062623175771,ARON,VICENTE GOMES LUIS,M,31520745060,fundamental incompleto,RS,92776-450,21.745232
3,4549084384535614861,ADA,BUZON SCANFERLA,F,31564113612,ensino medio completo,MG,30201-433,23.807220
4,8127233580870673453,ABADE,DE MORAES LOVATEL,M,36849054538,fundamental incompleto,BA,45908-655,31.831435

In [28]:
help(df.rank)

Help on method rank in module pandas.core.generic:

rank(axis=0, method: str = 'average', numeric_only: Union[bool, NoneType] = None, na_option: str = 'keep', ascending: bool = True, pct: bool = False) -> ~FrameOrSeries method of pandas.core.frame.DataFrame instance
    Compute numerical data ranks (1 through n) along axis.

    By default, equal values are assigned a rank that is the average of the
    ranks of those values.

    Parameters
    ----------
    axis : {0 or 'index', 1 or 'columns'}, default 0
        Index to direct ranking.
    method : {'average', 'min', 'max', 'first', 'dense'}, default 'average'
        How to rank the group of records that have the same value (i.e. ties):

        * average: average rank of the group
        * min: lowest rank in the group
        * max: highest rank in the group
        * first: ranks assigned in order they appear in the array
        * dense: like 'min', but rank always increases by 1 between groups.

    numeric_only : bool, optional
        For DataFrame objects, rank only numeric columns if set to True.
    na_option : {'keep', 'top', 'bottom'}, default 'keep'
        How to rank NaN values:

        * keep: assign NaN rank to NaN values
        * top: assign smallest rank to NaN values if ascending
        * bottom: assign highest rank to NaN values if ascending.

    ascending : bool, default True
        Whether or not the elements should be ranked in ascending order.
    pct : bool, default False
        Whether or not to display the returned rankings in percentile
        form.

    Returns
    -------
    same type as caller
        Return a Series or DataFrame with data ranks as values.

    See Also
    --------
    core.groupby.GroupBy.rank : Rank of values within each group.

    Examples
    --------
    >>> df = pd.DataFrame(data={'Animal': ['cat', 'penguin', 'dog',
    ...                                    'spider', 'snake'],
    ...                         'Number_legs': [4, 2, 4, 8, np.nan]})
    >>> df
        Animal  Number_legs
    0      cat          4.0
    1  penguin          2.0
    2      dog          4.0
    3   spider          8.0
    4    snake          NaN

    The following example shows how the method behaves with the above
    parameters:

    * default_rank: this is the default behaviour obtained without using
      any parameter.
    * max_rank: setting ``method = 'max'`` the records that have the
      same values are ranked using the highest rank (e.g.: since 'cat'
      and 'dog' are both in the 2nd and 3rd position, rank 3 is assigned.)
    * NA_bottom: choosing ``na_option = 'bottom'``, if there are records
      with NaN values they are placed at the bottom of the ranking.
    * pct_rank: when setting ``pct = True``, the ranking is expressed as
      percentile rank.

    >>> df['default_rank'] = df['Number_legs'].rank()
    >>> df['max_rank'] = df['Number_legs'].rank(method='max')
    >>> df['NA_bottom'] = df['Number_legs'].rank(na_option='bottom')
    >>> df['pct_rank'] = df['Number_legs'].rank(pct=True)
    >>> df
        Animal  Number_legs  default_rank  max_rank  NA_bottom  pct_rank
    0      cat          4.0           2.5       3.0        2.5     0.625
    1  penguin          2.0           1.0       1.0        1.0     0.250
    2      dog          4.0           2.5       3.0        2.5     0.625
    3   spider          8.0           4.0       4.0        4.0     1.000
    4    snake          NaN           NaN       NaN        5.0       NaN

In [50]:
df['rank'] = df.idade.rank()
df.sort_values('idade')[['nome','idade','rank']]

             nome      idade      rank
90519        GINI  19.677974       1.0
76466      TAIANI  20.000100       2.0
69438  RIANDERSON  20.000463       3.0
30206   GARBRIELA  20.000571       4.0
18772      DILCEA  20.001151       5.0
...           ...        ...       ...
43563      JULIAN  68.692147  100783.0
79614  VALDELICIO  69.535645  100784.0
86684    ADAILTON  70.877519  100785.0
91683       GERSE  71.585342  100786.0
84230       WELHO  76.191177  100787.0

[100787 rows x 3 columns]

In [51]:
df.query('idade.rank() < 3')

,id_cliente,nome,sobrenome,sexo,cpf,grau_instrucao,uf,cep,idade,rank
76466,1984718481367674904,TAIANI,BINELLE LEITÃO,F,36266767570,sem instrucao,BA,44808-256,20.000100,2.0
90519,-1179872305920289353,GINI,DE ANGELI MARCHESE,F,33123833666,fundamental incompleto,MG,37986-654,19.677974,1.0

In [52]:
df.filter(regex = 'nome|instruc')

            nome                sobrenome          grau_instrucao
0          ALINE           BETTIN BAIENSE    fundamental completo
1           ARAO  RASMUSEN TYRNE FUMANESI  fundamental incompleto
2           ARON       VICENTE GOMES LUIS  fundamental incompleto
3            ADA          BUZON SCANFERLA   ensino medio completo
4          ABADE        DE MORAES LOVATEL  fundamental incompleto
...          ...                      ...                     ...
100782  MACILEIA           MONENTE PIASSI   ensino medio completo
100783    JALINE     CREMARD BRANCAGLIONI   ensino medio completo
100784  DEMILTON       MENEGARDO DAL PIAZ       superior completo
100785     LIVIA           RIZZO SANDRINI       superior completo
100786    FABSON         CANZIAN CARLESSO  fundamental incompleto

[100787 rows x 3 columns]

In [40]:
df

,id_cliente,nome,sobrenome,sexo,cpf,grau_instrucao,uf,cep,idade,rank
0,-4835863059640323805,ALINE,BETTIN BAIENSE,F,36919884666,fundamental completo,MG,32401-614,25.653283,77268.0
1,-7812228504367106399,ARAO,RASMUSEN TYRNE FUMANESI,M,30289361869,fundamental incompleto,SP,15253-864,29.496348,53838.0
2,-615496062623175771,ARON,VICENTE GOMES LUIS,M,31520745060,fundamental incompleto,RS,92776-450,21.745232,94865.0
3,4549084384535614861,ADA,BUZON SCANFERLA,F,31564113612,ensino medio completo,MG,30201-433,23.807220,86419.0
4,8127233580870673453,ABADE,DE MORAES LOVATEL,M,36849054538,fundamental incompleto,BA,45908-655,31.831435,43016.0
...,...,...,...,...,...,...,...,...,...,...
100782,-6096263413536836676,MACILEIA,MONENTE PIASSI,F,31929017219,ensino medio completo,RO,76870-573,29.888898,51220.0
100783,-8454082737859566393,JALINE,CREMARD BRANCAGLIONI,F,30502373415,ensino medio completo,RN,59582-166,45.978005,5586.0
100784,-8614779537790932317,DEMILTON,MENEGARDO DAL PIAZ,M,32482251222,superior completo,RR,69388-701,21.044279,97385.0
100785,3394636096682398032,LIVIA,RIZZO SANDRINI,F,33174238382,superior completo,MA,65596-818,26.976741,69745.0
100786,1624599237057774553,FABSON,CANZIAN CARLESSO,M,34324489025,fundamental incompleto,RS,94424-688,32.145433,41730.0